# Data Preparation Week 7 and 8
## Joshua Greenert
## DSC540-T301 Data Preparation
## 10/15/2022

## Chapter 7

In [1]:
# Perform the modications to the dataset for chapter 7 methods.
import pandas as pd
import numpy as np

# Create the dataframe.
df_candy = pd.read_csv('candyhierarchy2017.csv',  encoding = "ISO-8859-1")
df_candy.head(5)

,Internal ID,Q1: GOING OUT?,Q2: GENDER,Q3: AGE,Q4: COUNTRY,"Q5: STATE, PROVINCE, COUNTY, ETC",Q6 | 100 Grand Bar,Q6 | Anonymous brown globs that come in black and orange wrappers\t(a.k.a. Mary Janes),Q6 | Any full-sized candy bar,Q6 | Black Jacks,...,Q8: DESPAIR OTHER,Q9: OTHER COMMENTS,Q10: DRESS,Unnamed: 113,Q11: DAY,Q12: MEDIA [Daily Dish],Q12: MEDIA [Science],Q12: MEDIA [ESPN],Q12: MEDIA [Yahoo],"Click Coordinates (x, y)"
0,90258773,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,90272821,No,Male,44,USA,NM,MEH,DESPAIR,JOY,MEH,...,NaN,Bottom line is Twix is really the only candy w...,White and gold,NaN,Sunday,NaN,1.0,NaN,NaN,"(84, 25)"
2,90272829,NaN,Male,49,USA,Virginia,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,90272840,No,Male,40,us,or,MEH,DESPAIR,JOY,MEH,...,NaN,Raisins can go to hell,White and gold,NaN,Sunday,NaN,1.0,NaN,NaN,"(75, 23)"
4,90272841,No,Male,23,usa,exton pa,JOY,DESPAIR,JOY,DESPAIR,...,NaN,NaN,White and gold,NaN,Friday,NaN,1.0,NaN,NaN,"(70, 10)"

In [2]:
# Replace values with mode for all categorical columns.
categorical_columns = df_candy.select_dtypes( include ='object').columns
df_candy[categorical_columns] = df_candy[categorical_columns].apply(lambda x: x.fillna(x.value_counts().index[0]))

In [3]:
# Replace values with median for all continuous columns.
# Remove column 'Q12: MEDIA [Daily Dish]', Q12: MEDIA [ESPN], Q12: MEDIA [Yahoo]
columns_to_drop = ['Q12: MEDIA [Daily Dish]','Q12: MEDIA [ESPN]', 'Q12: MEDIA [Yahoo]' ]
df_candy = df_candy.drop(columns_to_drop, axis=1)

## Chapter 8

In [4]:
# Perform a merge between the gender and age fields from the OG dataframe.
df_age = df_candy[['Internal ID', 'Q3: AGE']]
df_gender = df_candy[['Internal ID','Q2: GENDER']]
df_age_gender = pd.merge(df_age, df_gender)
df_age_gender.head(5)

   Internal ID Q3: AGE Q2: GENDER
0     90258773      40       Male
1     90272821      44       Male
2     90272829      49       Male
3     90272840      40       Male
4     90272841      23       Male

In [5]:
# Performa  pivot on the data.
df_candy.pivot(index='Internal ID', columns='Q2: GENDER', values='Q3: AGE')

Q2: GENDER  Female I'd rather not say Male Other
Internal ID
90258773       NaN                NaN   40   NaN
90272821       NaN                NaN   44   NaN
90272829       NaN                NaN   49   NaN
90272840       NaN                NaN   40   NaN
90272841       NaN                NaN   23   NaN
...            ...                ...  ...   ...
90314359       NaN                NaN   24   NaN
90314580        33                NaN  NaN   NaN
90314634        26                NaN  NaN   NaN
90314658       NaN                NaN   58   NaN
90314802        66                NaN  NaN   NaN

[2460 rows x 4 columns]

## Chapter 10

In [6]:
# Perform a groupby function for the mean age.
groupby_mean_age = df_candy.groupby(by="Q3: AGE", dropna=False).median()
groupby_mean_age

                 Internal ID  Q12: MEDIA [Science]
Q3: AGE
1                 90288589.0                   NaN
10                90273991.0                   1.0
100               90279492.5                   1.0
1000              90279807.0                   1.0
102               90276469.0                   1.0
...                      ...                   ...
old               90283533.0                   1.0
old enough        90295078.0                   1.0
older than dirt   90276526.0                   1.0
sixty-nine        90280448.0                   NaN
your mom          90298368.0                   NaN

[106 rows x 2 columns]

In [7]:
# Perform a crosstab function with country and age.
pd.crosstab(df_candy['Q4: COUNTRY'], df_candy['Q3: AGE'], margins=True)

Q3: AGE,1,10,100,1000,102,11,12,13,14,15,...,See question 2,ancient,hahahahaha,no,old,old enough,older than dirt,sixty-nine,your mom,All
Q4: COUNTRY,,,,,,,,,,,,,,,,,,,,,
'merica,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1
1,1,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1
32,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1
35,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1
45,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
united ststes,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1
us,0,0,0,0,0,1,1,1,0,0,...,0,0,0,0,0,0,0,0,0,40
usa,0,0,0,0,0,0,1,1,0,0,...,0,0,0,1,2,0,0,0,1,217
usas,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1
All,1,3,2,1,1,7,9,6,2,8,...,1,1,1,1,2,1,1,1,1,2460

## Chapter 11

In [13]:
# Convert the days column into date objects for graphing purposes.
# Set Sunday = 1/1/2022, Monday = 1/2/2022, etc.
from datetime import datetime

sun = datetime(2022, 1, 1)
mon = datetime(2022, 1, 2)
tue = datetime(2022, 1, 3)
wed = datetime(2022, 1, 4)
thu = datetime(2022, 1, 5)
fri = datetime(2022, 1, 6)
sat = datetime(2022, 1, 7)

# Loop over the dataframe and update the days.
for i, row in df_candy.iterrows():
    if(row['Q11: DAY'] == "Sunday"):
        df_candy.at[i,'Q11: DAY'] = sun
    elif(row['Q11: DAY'] == "Monday"):
        df_candy.at[i,'Q11: DAY'] = mon
    elif(row['Q11: DAY'] == "Tuesday"):
        df_candy.at[i,'Q11: DAY'] = tue
    elif(row['Q11: DAY'] == "Wednesday"):
        df_candy.at[i,'Q11: DAY'] = wed
    elif(row['Q11: DAY'] == "Thursday"):
        df_candy.at[i,'Q11: DAY'] = thu
    elif(row['Q11: DAY'] == "Friday"):
        df_candy.at[i,'Q11: DAY'] = fri
    elif(row['Q11: DAY'] == "Saturday"):
        df_candy.at[i,'Q11: DAY'] = sat
        
# Show the new rows.
count = 0
for index, row in df_candy.iterrows():
    if(count == 5):
        break;
    print(row['Q11: DAY'])
    count = count +1

2022-01-06 00:00:00
2022-01-01 00:00:00
2022-01-06 00:00:00
2022-01-01 00:00:00
2022-01-06 00:00:00

In [16]:
# Convert the new created column to strings.
df_candy['Q11: DAY']=df_candy['Q11: DAY'].astype(str)

type(df_candy['Q11: DAY'][0])

str